[{"name":"Pound","text":"The target is physically pounded with a long tail, a foreleg, or the like."},{"name":"Karate Chop","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Double Slap","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Comet Punch","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Mega Punch","text":"The target is slugged by a punch thrown with muscle-packed power."},{"name":"Pay Day","text":"Numerous coins are hurled at the target to inflict damage. Money is earned after the battle."},{"name":"Fire Punch","text":"The target is punched with a fiery fist. This may also leave the target with a burn."},{"name":"Ice Punch","text":"The target is punched with an icy fist. This may also leave the target frozen."},{"name":"Thunder Punch","text":"The target is punched with an electrified fist. This may also leave the target with paralysis."},{"name":"Scratch","text":"Hard, pointed, sharp claws rake the target to inflict damage."},{"name":"Vise Grip","text":"The target is gripped and squeezed from both sides to inflict damage."},{"name":"Guillotine","text":"A vicious, tearing attack with big pincers. The target faints instantly if this attack hits."},{"name":"Razor Wind","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Swords Dance","text":"A frenetic dance to uplift the fighting spirit. This sharply raises the user’s Attack stat."},{"name":"Cut","text":"The target is cut with a scythe or claw."},{"name":"Gust","text":"A gust of wind is whipped up by wings and launched at the target to inflict damage."},{"name":"Wing Attack","text":"The target is struck with large, imposing wings spread wide to inflict damage."},{"name":"Whirlwind","text":"The target is blown away, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon."},{"name":"Fly","text":"The user flies up into the sky and then strikes its target on the next turn."},{"name":"Bind","text":"Things such as long bodies or tentacles are used to bind and squeeze the target for four to five turns."},{"name":"Slam","text":"The target is slammed with a long tail, vines, or the like to inflict damage."},{"name":"Vine Whip","text":"The target is struck with slender, whiplike vines to inflict damage."},{"name":"Stomp","text":"The target is stomped with a big foot. This may also make the target flinch."},{"name":"Double Kick","text":"The target is quickly kicked twice in succession using both feet."},{"name":"Mega Kick","text":"The target is attacked by a kick launched with muscle-packed power."},{"name":"Jump Kick","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Rolling Kick","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sand Attack","text":"Sand is hurled in the target’s face, reducing the target’s accuracy."},{"name":"Headbutt","text":"The user sticks out its head and attacks by charging straight into the target. This may also make the target flinch."},{"name":"Horn Attack","text":"The target is jabbed with a sharply pointed horn to inflict damage."},{"name":"Fury Attack","text":"The target is jabbed repeatedly with a horn or beak two to five times in a row."},{"name":"Horn Drill","text":"The user stabs the target with a horn that rotates like a drill. The target faints instantly if this attack hits."},{"name":"Tackle","text":"A physical attack in which the user charges and slams into the target with its whole body."},{"name":"Body Slam","text":"The user drops onto the target with its full body weight. This may also leave the target with paralysis."},{"name":"Wrap","text":"A long body, vines, or the like are used to wrap and squeeze the target for four to five turns."},{"name":"Take Down","text":"A reckless, full-body charge attack for slamming into the target. This also damages the user a little."},{"name":"Thrash","text":"The user rampages and attacks for two to three turns. The user then becomes confused."},{"name":"Double-Edge","text":"A reckless, life-risking tackle in which the user rushes the target. This also damages the user quite a lot."},{"name":"Tail Whip","text":"The user wags its tail cutely, making opposing Pokémon less wary and lowering their Defense stats."},{"name":"Poison Sting","text":"The user stabs the target with a poisonous stinger. This may also poison the target."},{"name":"Twineedle","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Pin Missile","text":"Sharp spikes are shot at the target in rapid succession. They hit two to five times in a row."},{"name":"Leer","text":"The user gives opposing Pokémon an intimidating leer that lowers the Defense stat."},{"name":"Bite","text":"The target is bitten with viciously sharp fangs. This may also make the target flinch."},{"name":"Growl","text":"The user growls in an endearing way, making opposing Pokémon less wary. This lowers their Attack stats."},{"name":"Roar","text":"The target is scared off, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon."},{"name":"Sing","text":"A soothing lullaby is sung in a calming voice that puts the target into a deep slumber."},{"name":"Supersonic","text":"The user generates odd sound waves from its body that confuse the target."},{"name":"Sonic Boom","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Disable","text":"For four turns, this move prevents the target from using the move it last used."},{"name":"Acid","text":"Opposing Pokémon are attacked with a spray of harsh acid. This may also lower their Sp. Def stats."},{"name":"Ember","text":"The target is attacked with small flames. This may also leave the target with a burn."},{"name":"Flamethrower","text":"The target is scorched with an intense blast of fire. This may also leave the target with a burn."},{"name":"Mist","text":"The user cloaks itself and its allies in a white mist that prevents any of their stats from being lowered for five turns."},{"name":"Water Gun","text":"The target is blasted with a forceful shot of water."},{"name":"Hydro Pump","text":"The target is blasted by a huge volume of water launched under great pressure."},{"name":"Surf","text":"The user attacks everything around it by swamping its surroundings with a giant wave."},{"name":"Ice Beam","text":"The target is struck with an icy-cold beam of energy. This may also leave the target frozen."},{"name":"Blizzard","text":"A howling blizzard is summoned to strike opposing Pokémon. This may also leave the opposing Pokémon frozen."},{"name":"Psybeam","text":"The target is attacked with a peculiar ray. This may also leave the target confused."},{"name":"Bubble Beam","text":"A spray of bubbles is forcefully ejected at the target. This may also lower the target’s Speed stat."},{"name":"Aurora Beam","text":"The target is hit with a rainbow-colored beam. This may also lower the target’s Attack stat."},{"name":"Hyper Beam","text":"The target is attacked with a powerful beam. The user can’t move on the next turn."},{"name":"Peck","text":"The target is jabbed with a sharply pointed beak or horn."},{"name":"Drill Peck","text":"A corkscrewing attack that strikes the target with a sharp beak acting as a drill."},{"name":"Submission","text":"The user grabs the target and recklessly dives for the ground. This also damages the user a little."},{"name":"Low Kick","text":"A powerful low kick that makes the target fall over. The heavier the target, the greater the move’s power."},{"name":"Counter","text":"A retaliation move that counters any physical attack, inflicting double the damage taken."},{"name":"Seismic Toss","text":"The target is thrown using the power of gravity. It inflicts damage equal to the user’s level."},{"name":"Strength","text":"The target is slugged with a punch thrown at maximum power."},{"name":"Absorb","text":"A nutrient-draining attack. The user’s HP is restored by half the damage taken by the target."},{"name":"Mega Drain","text":"A nutrient-draining attack. The user’s HP is restored by half the damage taken by the target."},{"name":"Leech Seed","text":"A seed is planted on the target. It steals some HP from the target every turn."},{"name":"Growth","text":"The user’s body grows all at once, raising the Attack and Sp. Atk stats."},{"name":"Razor Leaf","text":"Sharp-edged leaves are launched to slash at opposing Pokémon. Critical hits land more easily."},{"name":"Solar Beam","text":"In this two-turn attack, the user gathers light, then blasts a bundled beam on the next turn."},{"name":"Poison Powder","text":"The user scatters a cloud of poisonous dust that poisons the target."},{"name":"Stun Spore","text":"The user scatters a cloud of numbing powder that paralyzes the target."},{"name":"Sleep Powder","text":"The user scatters a big cloud of sleep-inducing dust around the target."},{"name":"Petal Dance","text":"The user attacks the target by scattering petals for two to three turns. The user then becomes confused."},{"name":"String Shot","text":"Opposing Pokémon are bound with silk blown from the user’s mouth that harshly lowers the Speed stat."},{"name":"Dragon Rage","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Fire Spin","text":"The target becomes trapped within a fierce vortex of fire that rages for four to five turns."},{"name":"Thunder Shock","text":"A jolt of electricity crashes down on the target to inflict damage. This may also leave the target with paralysis."},{"name":"Thunderbolt","text":"A strong electric blast crashes down on the target. This may also leave the target with paralysis."},{"name":"Thunder Wave","text":"The user launches a weak jolt of electricity that paralyzes the target."},{"name":"Thunder","text":"A wicked thunderbolt is dropped on the target to inflict damage. This may also leave the target with paralysis."},{"name":"Rock Throw","text":"The user picks up and throws a small rock at the target to attack."},{"name":"Earthquake","text":"The user sets off an earthquake that strikes every Pokémon around it."},{"name":"Fissure","text":"The user opens up a fissure in the ground and drops the target in. The target faints instantly if this attack hits."},{"name":"Dig","text":"The user burrows into the ground, then attacks on the next turn."},{"name":"Toxic","text":"A move that leaves the target badly poisoned. Its poison damage worsens every turn."},{"name":"Confusion","text":"The target is hit by a weak telekinetic force. This may also confuse the target."},{"name":"Psychic","text":"The target is hit by a strong telekinetic force. This may also lower the target’s Sp. Def stat."},{"name":"Hypnosis","text":"The user employs hypnotic suggestion to make the target fall into a deep sleep."},{"name":"Meditate","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Agility","text":"The user relaxes and lightens its body to move faster. This sharply raises the Speed stat."},{"name":"Quick Attack","text":"The user lunges at the target at a speed that makes it almost invisible. This move always goes first."},{"name":"Rage","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Teleport","text":"The user switches places with a party Pokémon in waiting, if any. If a wild Pokémon uses this move, it flees."},{"name":"Night Shade","text":"The user makes the target see a frightening mirage. It inflicts damage equal to the user’s level."},{"name":"Mimic","text":"The user copies the target’s last move. The move can be used during battle until the Pokémon is switched out."},{"name":"Screech","text":"An earsplitting screech harshly lowers the target’s Defense stat."},{"name":"Double Team","text":"By moving rapidly, the user makes illusory copies of itself to raise its evasiveness."},{"name":"Recover","text":"Restoring its own cells, the user restores its own HP by half of its max HP."},{"name":"Harden","text":"The user stiffens all the muscles in its body to raise its Defense stat."},{"name":"Minimize","text":"The user compresses its body to make itself look smaller, which sharply raises its evasiveness."},{"name":"Smokescreen","text":"The user releases an obscuring cloud of smoke or ink. This lowers the target’s accuracy."},{"name":"Confuse Ray","text":"The target is exposed to a sinister ray that triggers confusion."},{"name":"Withdraw","text":"The user withdraws its body into its hard shell, raising its Defense stat."},{"name":"Defense Curl","text":"The user curls up to conceal weak spots and raise its Defense stat."},{"name":"Barrier","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Light Screen","text":"A wondrous wall of light is put up to reduce damage from special attacks for five turns."},{"name":"Haze","text":"The user creates a haze that eliminates every stat change among all the Pokémon engaged in battle."},{"name":"Reflect","text":"A wondrous wall of light is put up to reduce damage from physical attacks for five turns."},{"name":"Focus Energy","text":"The user takes a deep breath and focuses so that critical hits land more easily."},{"name":"Bide","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Metronome","text":"The user waggles a finger and stimulates its brain into randomly using nearly any move."},{"name":"Mirror Move","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Self-Destruct","text":"The user attacks everything around it by causing an explosion. The user faints upon using this move."},{"name":"Egg Bomb","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Lick","text":"The target is licked with a long tongue, causing damage. This may also leave the target with paralysis."},{"name":"Smog","text":"The target is attacked with a discharge of filthy gases. This may also poison the target."},{"name":"Sludge","text":"Unsanitary sludge is hurled at the target. This may also poison the target."},{"name":"Bone Club","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Fire Blast","text":"The target is attacked with an intense blast of all-consuming fire. This may also leave the target with a burn."},{"name":"Waterfall","text":"The user charges at the target and may make it flinch."},{"name":"Clamp","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Swift","text":"Star-shaped rays are shot at opposing Pokémon. This attack never misses."},{"name":"Skull Bash","text":"The user tucks in its head to raise its Defense stat on the first turn, then rams the target on the next turn."},{"name":"Spike Cannon","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Constrict","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Amnesia","text":"The user temporarily empties its mind to forget its concerns. This sharply raises the user’s Sp. Def stat."},{"name":"Kinesis","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Soft-Boiled","text":"The user restores its own HP by up to half of its max HP."},{"name":"High Jump Kick","text":"The target is attacked with a knee kick from a jump. If it misses, the user is hurt instead."},{"name":"Glare","text":"The user intimidates the target with the pattern on its belly to cause paralysis."},{"name":"Dream Eater","text":"The user eats the dreams of a sleeping target. The user’s HP is restored by half the damage taken by the target."},{"name":"Poison Gas","text":"A cloud of poison gas is sprayed in the face of opposing Pokémon, poisoning those it hits."},{"name":"Barrage","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Leech Life","text":"The user drains the target’s blood. The user’s HP is restored by half the damage taken by the target."},{"name":"Lovely Kiss","text":"With a scary face, the user tries to force a kiss on the target. If it succeeds, the target falls asleep."},{"name":"Sky Attack","text":"A second-turn attack move where critical hits land more easily. This may also make the target flinch."},{"name":"Transform","text":"The user transforms into a copy of the target right down to having the same move set."},{"name":"Bubble","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Dizzy Punch","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Spore","text":"The user scatters bursts of spores that induce sleep."},{"name":"Flash","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Psywave","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Splash","text":"The user just flops and splashes around to no effect at all..."},{"name":"Acid Armor","text":"The user alters its cellular structure to liquefy itself, sharply raising its Defense stat."},{"name":"Crabhammer","text":"The target is hammered with a large pincer. Critical hits land more easily."},{"name":"Explosion","text":"The user attacks everything around it by causing a tremendous explosion. The user faints upon using this move."},{"name":"Fury Swipes","text":"The target is raked with sharp claws or scythes quickly two to five times in a row."},{"name":"Bonemerang","text":"The user throws the bone it holds. The bone loops around to hit the target twice—coming and going."},{"name":"Rest","text":"The user goes to sleep for two turns. This fully restores the user’s HP and heals any status conditions."},{"name":"Rock Slide","text":"Large boulders are hurled at opposing Pokémon to inflict damage. This may also make the opposing Pokémon flinch."},{"name":"Hyper Fang","text":"The user bites hard on the target with its sharp front fangs. This may also make the target flinch."},{"name":"Sharpen","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Conversion","text":"The user changes its type to become the same type as the move at the top of the list of moves it knows."},{"name":"Tri Attack","text":"The user strikes with a simultaneous three-beam attack. This may also burn, freeze, or paralyze the target."},{"name":"Super Fang","text":"The user chomps hard on the target with its sharp front fangs. This cuts the target’s HP in half."},{"name":"Slash","text":"The target is attacked with a slash of claws or blades. Critical hits land more easily."},{"name":"Substitute","text":"The user creates a substitute for itself using some of its HP. The substitute serves as the user’s decoy."},{"name":"Struggle","text":"This attack is used in desperation only if the user has no PP. It also damages the user a little."},{"name":"Sketch","text":"It enables the user to permanently learn the move last used by the target. Once used, Sketch disappears."},{"name":"Triple Kick","text":"A consecutive three-kick attack that becomes more powerful with each successful hit."},{"name":"Thief","text":"The user attacks and steals the target’s held item simultaneously. The user can’t steal anything if it already holds an item."},{"name":"Spider Web","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Mind Reader","text":"The user senses the target’s movements with its mind to ensure its next attack does not miss the target."},{"name":"Nightmare","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Flame Wheel","text":"The user cloaks itself in fire and charges at the target. This may also leave the target with a burn."},{"name":"Snore","text":"This attack can be used only if the user is asleep. The harsh noise may also make the target flinch."},{"name":"Curse","text":"A move that works differently for the Ghost type than for all other types."},{"name":"Flail","text":"The user flails about aimlessly to attack. The less HP the user has, the greater the move’s power."},{"name":"Conversion 2","text":"The user changes its type to make itself resistant to the type of the attack the target used last."},{"name":"Aeroblast","text":"A vortex of air is shot at the target to inflict damage. Critical hits land more easily."},{"name":"Cotton Spore","text":"The user releases cotton-like spores that cling to opposing Pokémon, which harshly lowers their Speed stats."},{"name":"Reversal","text":"An all-out attack that becomes more powerful the less HP the user has."},{"name":"Spite","text":"The user unleashes its grudge on the move last used by the target by cutting 4 PP from it."},{"name":"Powder Snow","text":"The user attacks with a chilling gust of powdery snow. This may also freeze opposing Pokémon."},{"name":"Protect","text":"This move enables the user to protect itself from all attacks. Its chance of failing rises if it is used in succession."},{"name":"Mach Punch","text":"The user throws a punch at blinding speed. This move always goes first."},{"name":"Scary Face","text":"The user frightens the target with a scary face to harshly lower its Speed stat."},{"name":"Feint Attack","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sweet Kiss","text":"The user kisses the target with a sweet, angelic cuteness that causes confusion."},{"name":"Belly Drum","text":"The user maximizes its Attack stat in exchange for HP equal to half its max HP."},{"name":"Sludge Bomb","text":"Unsanitary sludge is hurled at the target. This may also poison the target."},{"name":"Mud-Slap","text":"The user hurls mud in the target’s face to inflict damage and lower its accuracy."},{"name":"Octazooka","text":"The user attacks by spraying ink in the target’s face or eyes. This may also lower the target’s accuracy."},{"name":"Spikes","text":"The user lays a trap of spikes at the opposing team’s feet. The trap hurts Pokémon that switch into battle."},{"name":"Zap Cannon","text":"The user fires an electric blast like a cannon to inflict damage and cause paralysis."},{"name":"Foresight","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Destiny Bond","text":"After using this move, if the user faints, the Pokémon that landed the knockout hit also faints. Its chance of failing rises if it is used in succession."},{"name":"Perish Song","text":"Any Pokémon that hears this song faints in three turns, unless it switches out of battle."},{"name":"Icy Wind","text":"The user attacks with a gust of chilled air. This also lowers opposing Pokémon’s Speed stats."},{"name":"Detect","text":"This move enables the user to protect itself from all attacks. Its chance of failing rises if it is used in succession."},{"name":"Bone Rush","text":"The user strikes the target with a hard bone two to five times in a row."},{"name":"Lock-On","text":"The user takes sure aim at the target. This ensures the next attack does not miss the target."},{"name":"Outrage","text":"The user rampages and attacks for two to three turns. The user then becomes confused."},{"name":"Sandstorm","text":"A five-turn sandstorm is summoned to hurt all combatants except Rock, Ground, and Steel types. It raises the Sp. Def stat of Rock types."},{"name":"Giga Drain","text":"A nutrient-draining attack. The user’s HP is restored by half the damage taken by the target."},{"name":"Endure","text":"The user endures any attack with at least 1 HP. Its chance of failing rises if it is used in succession."},{"name":"Charm","text":"The user gazes at the target rather charmingly, making it less wary. This harshly lowers the target’s Attack stat."},{"name":"Rollout","text":"The user continually rolls into the target over five turns. It becomes more powerful each time it hits."},{"name":"False Swipe","text":"A restrained attack that prevents the target from fainting. The target is left with at least 1 HP."},{"name":"Swagger","text":"The user enrages and confuses the target. However, this also sharply raises the target’s Attack stat."},{"name":"Milk Drink","text":"The user restores its own HP by up to half of its max HP."},{"name":"Spark","text":"The user throws an electrically charged tackle at the target. This may also leave the target with paralysis."},{"name":"Fury Cutter","text":"The target is slashed with scythes or claws. This attack becomes more powerful if it hits in succession."},{"name":"Steel Wing","text":"The target is hit with wings of steel. This may also raise the user’s Defense stat."},{"name":"Mean Look","text":"The user pins the target with a dark, arresting look. The target becomes unable to flee."},{"name":"Attract","text":"If it is the opposite gender of the user, the target becomes infatuated and less likely to attack."},{"name":"Sleep Talk","text":"While it is asleep, the user randomly uses one of the moves it knows."},{"name":"Heal Bell","text":"The user makes a soothing bell chime to heal the status conditions of all the party Pokémon."},{"name":"Return","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Present","text":"The user attacks by giving the target a gift with a hidden trap. It restores HP sometimes, however."},{"name":"Frustration","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Safeguard","text":"The user creates a protective field that prevents status conditions for five turns."},{"name":"Pain Split","text":"The user adds its HP to the target’s HP, then equally shares the combined HP with the target."},{"name":"Sacred Fire","text":"The target is razed with a mystical fire of great intensity. This may also leave the target with a burn."},{"name":"Magnitude","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Dynamic Punch","text":"The user punches the target with full, concentrated power. This confuses the target if it hits."},{"name":"Megahorn","text":"Using its tough and impressive horn, the user rams into the target with no letup."},{"name":"Dragon Breath","text":"The user exhales a mighty gust that inflicts damage. This may also leave the target with paralysis."},{"name":"Baton Pass","text":"The user switches places with a party Pokémon in waiting and passes along any stat changes."},{"name":"Encore","text":"The user compels the target to keep using the move it encored for three turns."},{"name":"Pursuit","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Rapid Spin","text":"A spin attack that can also eliminate such moves as Bind, Wrap, and Leech Seed. This also raises the user’s Speed stat."},{"name":"Sweet Scent","text":"A sweet scent that harshly lowers opposing Pokémon’s evasiveness."},{"name":"Iron Tail","text":"The target is slammed with a steel-hard tail. This may also lower the target’s Defense stat."},{"name":"Metal Claw","text":"The target is raked with steel claws. This may also raise the user’s Attack stat."},{"name":"Vital Throw","text":"The user attacks last. In return, this throw move never misses."},{"name":"Morning Sun","text":"The user restores its own HP. The amount of HP regained varies with the weather."},{"name":"Synthesis","text":"The user restores its own HP. The amount of HP regained varies with the weather."},{"name":"Moonlight","text":"The user restores its own HP. The amount of HP regained varies with the weather."},{"name":"Hidden Power","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Cross Chop","text":"The user delivers a double chop with its forearms crossed. Critical hits land more easily."},{"name":"Twister","text":"The user whips up a vicious tornado to tear at opposing Pokémon. This may also make them flinch."},{"name":"Rain Dance","text":"The user summons a heavy rain that falls for five turns, powering up Water-type moves. It lowers the power of Fire-type moves."},{"name":"Sunny Day","text":"The user intensifies the sun for five turns, powering up Fire-type moves. It lowers the power of Water-type moves."},{"name":"Crunch","text":"The user crunches up the target with sharp fangs. This may also lower the target’s Defense stat."},{"name":"Mirror Coat","text":"A retaliation move that counters any special attack, inflicting double the damage taken."},{"name":"Psych Up","text":"The user hypnotizes itself into copying any stat change made by the target."},{"name":"Extreme Speed","text":"The user charges the target at blinding speed. This move always goes first."},{"name":"Ancient Power","text":"The user attacks with a prehistoric power. This may also raise all the user’s stats at once."},{"name":"Shadow Ball","text":"The user hurls a shadowy blob at the target. This may also lower the target’s Sp. Def stat."},{"name":"Future Sight","text":"Two turns after this move is used, a hunk of psychic energy attacks the target."},{"name":"Rock Smash","text":"The user attacks with a punch. This may also lower the target’s Defense stat."},{"name":"Whirlpool","text":"The user traps the target in a violent swirling whirlpool for four to five turns."},{"name":"Beat Up","text":"The user gets all party Pokémon to attack the target. The more party Pokémon, the greater the number of attacks."},{"name":"Fake Out","text":"This attack hits first and makes the target flinch. It only works the first turn each time the user enters battle."},{"name":"Uproar","text":"The user attacks in an uproar for three turns. During that time, no Pokémon can fall asleep."},{"name":"Stockpile","text":"The user charges up power and raises both its Defense and Sp. Def stats. The move can be used three times."},{"name":"Spit Up","text":"The power stored using the move Stockpile is released at once in an attack. The more power is stored, the greater the move’s power."},{"name":"Swallow","text":"The power stored using the move Stockpile is absorbed by the user to heal its HP. Storing more power heals more HP."},{"name":"Heat Wave","text":"The user attacks by exhaling hot breath on opposing Pokémon. This may also leave those Pokémon with a burn."},{"name":"Hail","text":"The user summons a hailstorm lasting five turns. It damages all Pokémon except Ice types."},{"name":"Torment","text":"The user torments and enrages the target, making it incapable of using the same move twice in a row."},{"name":"Flatter","text":"Flattery is used to confuse the target. However, this also raises the target’s Sp. Atk stat."},{"name":"Will-O-Wisp","text":"The user shoots a sinister flame at the target to inflict a burn."},{"name":"Memento","text":"The user faints when using this move. In return, this harshly lowers the target’s Attack and Sp. Atk stats."},{"name":"Facade","text":"This attack move doubles its power if the user is poisoned, burned, or paralyzed."},{"name":"Focus Punch","text":"The user focuses its mind before launching a punch. This move fails if the user is hit before it is used."},{"name":"Smelling Salts","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Follow Me","text":"The user draws attention to itself, making all targets take aim only at the user."},{"name":"Nature Power","text":"This attack makes use of nature’s power. Its effects vary depending on the user’s environment."},{"name":"Charge","text":"The user boosts the power of the Electric move it uses on the next turn. This also raises the user’s Sp. Def stat."},{"name":"Taunt","text":"The target is taunted into a rage that allows it to use only attack moves for three turns."},{"name":"Helping Hand","text":"The user assists an ally by boosting the power of that ally’s attack."},{"name":"Trick","text":"The user catches the target off guard and swaps its held item with its own."},{"name":"Role Play","text":"The user mimics the target completely, copying the target’s Ability."},{"name":"Wish","text":"One turn after this move is used, the user’s or its replacement’s HP is restored by half the user’s max HP."},{"name":"Assist","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Ingrain","text":"The user lays roots that restore its HP on every turn. Because it’s rooted, it can’t switch out."},{"name":"Superpower","text":"The user attacks the target with great power. However, this also lowers the user’s Attack and Defense stats."},{"name":"Magic Coat","text":"Moves like Leech Seed and moves that inflict status conditions are blocked by a barrier and reflected back to the user of those moves."},{"name":"Recycle","text":"The user recycles a held item that has been used in battle so it can be used again."},{"name":"Revenge","text":"This attack move’s power is doubled if the user has been hurt by the opponent in the same turn."},{"name":"Brick Break","text":"The user attacks with a swift chop. It can also break barriers, such as Light Screen and Reflect."},{"name":"Yawn","text":"The user lets loose a huge yawn that lulls the target into falling asleep on the next turn."},{"name":"Knock Off","text":"The user slaps down the target’s held item, and that item can’t be used in that battle. The move does more damage if the target has a held item."},{"name":"Endeavor","text":"This attack move cuts down the target’s HP to equal the user’s HP."},{"name":"Eruption","text":"The user attacks opposing Pokémon with explosive fury. The lower the user’s HP, the lower the move’s power."},{"name":"Skill Swap","text":"The user employs its psychic power to exchange Abilities with the target."},{"name":"Imprison","text":"If opposing Pokémon know any move also known by the user, they are prevented from using it."},{"name":"Refresh","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Grudge","text":"If the user faints, the user’s grudge fully depletes the PP of the opponent’s move that knocked it out."},{"name":"Snatch","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Secret Power","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Dive","text":"Diving on the first turn, the user floats up and attacks on the next turn."},{"name":"Arm Thrust","text":"The user lets loose a flurry of open-palmed arm thrusts that hit two to five times in a row."},{"name":"Camouflage","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Tail Glow","text":"The user stares at flashing lights to focus its mind, drastically raising its Sp. Atk stat."},{"name":"Luster Purge","text":"The user lets loose a damaging burst of light. This may also lower the target’s Sp. Def stat."},{"name":"Mist Ball","text":"A mist-like flurry of down envelops and damages the target. This may also lower the target’s Sp. Atk stat."},{"name":"Feather Dance","text":"The user covers the target’s body with a mass of down that harshly lowers its Attack stat."},{"name":"Teeter Dance","text":"The user performs a wobbly dance that confuses the Pokémon around it."},{"name":"Blaze Kick","text":"The user launches a kick that lands a critical hit more easily. This may also leave the target with a burn."},{"name":"Mud Sport","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Ice Ball","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Needle Arm","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Slack Off","text":"The user slacks off, restoring its own HP by up to half of its max HP."},{"name":"Hyper Voice","text":"The user lets loose a horribly echoing shout with the power to inflict damage."},{"name":"Poison Fang","text":"The user bites the target with toxic fangs. This may also leave the target badly poisoned."},{"name":"Crush Claw","text":"The user slashes the target with hard and sharp claws. This may also lower the target’s Defense stat."},{"name":"Blast Burn","text":"The target is razed by a fiery explosion. The user can’t move on the next turn."},{"name":"Hydro Cannon","text":"The target is hit with a watery blast. The user can’t move on the next turn."},{"name":"Meteor Mash","text":"The target is hit with a hard punch fired like a meteor. This may also raise the user’s Attack stat."},{"name":"Astonish","text":"The user attacks the target while shouting in a startling fashion. This may also make the target flinch."},{"name":"Weather Ball","text":"This attack move varies in power and type depending on the weather."},{"name":"Aromatherapy","text":"The user releases a soothing scent that heals all status conditions affecting the user’s party."},{"name":"Fake Tears","text":"The user feigns crying to fluster the target, harshly lowering its Sp. Def stat."},{"name":"Air Cutter","text":"The user launches razor-like wind to slash opposing Pokémon. Critical hits land more easily."},{"name":"Overheat","text":"The user attacks the target at full power. The attack’s recoil harshly lowers the user’s Sp. Atk stat."},{"name":"Odor Sleuth","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Rock Tomb","text":"Boulders are hurled at the target. This also lowers the target’s Speed stat by preventing its movement."},{"name":"Silver Wind","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Metal Sound","text":"A horrible sound like scraping metal harshly lowers the target’s Sp. Def stat."},{"name":"Grass Whistle","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Tickle","text":"The user tickles the target into laughing, reducing its Attack and Defense stats."},{"name":"Cosmic Power","text":"The user absorbs a mystical power from space to raise its Defense and Sp. Def stats."},{"name":"Water Spout","text":"The user spouts water to damage opposing Pokémon. The lower the user’s HP, the lower the move’s power."},{"name":"Signal Beam","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Shadow Punch","text":"The user throws a punch from the shadows. This attack never misses."},{"name":"Extrasensory","text":"The user attacks with an odd, unseeable power. This may also make the target flinch."},{"name":"Sky Uppercut","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sand Tomb","text":"The user traps the target inside a harshly raging sandstorm for four to five turns."},{"name":"Sheer Cold","text":"The target faints instantly. It’s less likely to hit the target if it’s used by Pokémon other than Ice types."},{"name":"Muddy Water","text":"The user attacks by shooting muddy water at opposing Pokémon. This may also lower their accuracy."},{"name":"Bullet Seed","text":"The user forcefully shoots seeds at the target two to five times in a row."},{"name":"Aerial Ace","text":"The user confounds the target with speed, then slashes. This attack never misses."},{"name":"Icicle Spear","text":"The user launches sharp icicles at the target two to five times in a row."},{"name":"Iron Defense","text":"The user hardens its body’s surface like iron, sharply raising its Defense stat."},{"name":"Block","text":"The user blocks the target’s way with arms spread wide to prevent escape."},{"name":"Howl","text":"The user howls loudly to raise the spirit of itself and allies. This raises their Attack stats."},{"name":"Dragon Claw","text":"The user slashes the target with huge sharp claws."},{"name":"Frenzy Plant","text":"The user slams the target with the roots of an enormous tree. The user can’t move on the next turn."},{"name":"Bulk Up","text":"The user tenses its muscles to bulk up its body, raising both its Attack and Defense stats."},{"name":"Bounce","text":"The user bounces up high, then drops on the target on the second turn. This may also leave the target with paralysis."},{"name":"Mud Shot","text":"The user attacks by hurling a blob of mud at the target. This also lowers the target’s Speed stat."},{"name":"Poison Tail","text":"The user hits the target with its tail. This may also poison the target. Critical hits land more easily."},{"name":"Covet","text":"The user endearingly approaches the target, then steals the target’s held item."},{"name":"Volt Tackle","text":"The user electrifies itself and charges the target. This also damages the user quite a lot. This attack may leave the target with paralysis."},{"name":"Magical Leaf","text":"The user scatters curious leaves that chase the target. This attack never misses."},{"name":"Water Sport","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Calm Mind","text":"The user quietly focuses its mind and calms its spirit to raise its Sp. Atk and Sp. Def stats."},{"name":"Leaf Blade","text":"The user handles a sharp leaf like a sword and attacks by cutting its target. Critical hits land more easily."},{"name":"Dragon Dance","text":"The user vigorously performs a mystic, powerful dance that raises its Attack and Speed stats."},{"name":"Rock Blast","text":"The user hurls hard rocks at the target. Two to five rocks are launched in a row."},{"name":"Shock Wave","text":"The user strikes the target with a quick jolt of electricity. This attack never misses."},{"name":"Water Pulse","text":"The user attacks the target with a pulsing blast of water. This may also confuse the target."},{"name":"Doom Desire","text":"Two turns after this move is used, a concentrated bundle of light blasts the target."},{"name":"Psycho Boost","text":"The user attacks the target at full power. The attack’s recoil harshly lowers the user’s Sp. Atk stat."},{"name":"Roost","text":"The user lands and rests its body. This move restores the user’s HP by up to half of its max HP."},{"name":"Gravity","text":"This move enables Flying-type Pokémon or Pokémon with the Levitate Ability to be hit by Ground-type moves. Moves that involve flying can’t be used."},{"name":"Miracle Eye","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Wake-Up Slap","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Hammer Arm","text":"The user swings and hits with its strong, heavy fist. It lowers the user’s Speed, however."},{"name":"Gyro Ball","text":"The user tackles the target with a high-speed spin. The slower the user compared to the target, the greater the move’s power."},{"name":"Healing Wish","text":"The user faints. In return, the Pokémon taking its place will have its HP restored and status conditions cured."},{"name":"Brine","text":"If the target’s HP is half or less, this attack will hit with double the power."},{"name":"Natural Gift","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Feint","text":"This attack hits a target using a move such as Protect or Detect. This also lifts the effects of those moves."},{"name":"Pluck","text":"The user pecks the target. If the target is holding a Berry, the user eats it and gains its effect."},{"name":"Tailwind","text":"The user whips up a turbulent whirlwind that ups the Speed stats of the user and its allies for four turns."},{"name":"Acupressure","text":"The user applies pressure to stress points, sharply boosting one of its or its allies’ stats."},{"name":"Metal Burst","text":"The user retaliates with much greater force against the opponent that last inflicted damage on it."},{"name":"U-turn","text":"After making its attack, the user rushes back to switch places with a party Pokémon in waiting."},{"name":"Close Combat","text":"The user fights the target up close without guarding itself. This also lowers the user’s Defense and Sp. Def stats."},{"name":"Payback","text":"The user stores power, then attacks. If the user moves after the target, this attack’s power will be doubled."},{"name":"Assurance","text":"If the target has already taken some damage in the same turn, this attack’s power is doubled."},{"name":"Embargo","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Fling","text":"The user flings its held item at the target to attack. This move’s power and effects depend on the item."},{"name":"Psycho Shift","text":"Using its psychic power of suggestion, the user transfers its status conditions to the target."},{"name":"Trump Card","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Heal Block","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Wring Out","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Power Trick","text":"The user employs its psychic power to switch its Attack stat with its Defense stat."},{"name":"Gastro Acid","text":"The user hurls up its stomach acids on the target. The fluid eliminates the effect of the target’s Ability."},{"name":"Lucky Chant","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Me First","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Copycat","text":"The user mimics the move used immediately before it. The move fails if no other move has been used yet."},{"name":"Power Swap","text":"The user employs its psychic power to switch changes to its Attack and Sp. Atk stats with the target."},{"name":"Guard Swap","text":"The user employs its psychic power to switch changes to its Defense and Sp. Def stats with the target."},{"name":"Punishment","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Last Resort","text":"This move can be used only after the user has used all the other moves it knows in the battle."},{"name":"Worry Seed","text":"A seed that causes worry is planted on the target. It prevents sleep by making the target’s Ability Insomnia."},{"name":"Sucker Punch","text":"This move enables the user to attack first. This move fails if the target is not readying an attack."},{"name":"Toxic Spikes","text":"The user lays a trap of poison spikes at the feet of the opposing team. The spikes will poison opposing Pokémon that switch into battle."},{"name":"Heart Swap","text":"The user employs its psychic power to switch stat changes with the target."},{"name":"Aqua Ring","text":"The user envelops itself in a veil made of water. It regains some HP every turn."},{"name":"Magnet Rise","text":"The user levitates using electrically generated magnetism for five turns."},{"name":"Flare Blitz","text":"The user cloaks itself in fire and charges the target. This also damages the user quite a lot. This attack may leave the target with a burn."},{"name":"Force Palm","text":"The target is attacked with a shock wave. This may also leave the target with paralysis."},{"name":"Aura Sphere","text":"The user lets loose a blast of aura power from deep within its body at the target. This attack never misses."},{"name":"Rock Polish","text":"The user polishes its body to reduce drag. This sharply raises the Speed stat."},{"name":"Poison Jab","text":"The target is stabbed with a tentacle, arm, or the like steeped in poison. This may also poison the target."},{"name":"Dark Pulse","text":"The user releases a horrible aura imbued with dark thoughts. This may also make the target flinch."},{"name":"Night Slash","text":"The user slashes the target the instant an opportunity arises. Critical hits land more easily."},{"name":"Aqua Tail","text":"The user attacks by swinging its tail as if it were a vicious wave in a raging storm."},{"name":"Seed Bomb","text":"The user slams a barrage of hard-shelled seeds down on the target from above."},{"name":"Air Slash","text":"The user attacks with a blade of air that slices even the sky. This may also make the target flinch."},{"name":"X-Scissor","text":"The user slashes at the target by crossing its scythes or claws as if they were a pair of scissors."},{"name":"Bug Buzz","text":"The user generates a damaging sound wave by vibration. This may also lower the target’s Sp. Def stat."},{"name":"Dragon Pulse","text":"The target is attacked with a shock wave generated by the user’s gaping mouth."},{"name":"Dragon Rush","text":"The user tackles the target while exhibiting overwhelming menace. This may also make the target flinch."},{"name":"Power Gem","text":"The user attacks with a ray of light that sparkles as if it were made of gemstones."},{"name":"Drain Punch","text":"An energy-draining punch. The user’s HP is restored by half the damage taken by the target."},{"name":"Vacuum Wave","text":"The user whirls its fists to send a wave of pure vacuum at the target. This move always goes first."},{"name":"Focus Blast","text":"The user heightens its mental focus and unleashes its power. This may also lower the target’s Sp. Def stat."},{"name":"Energy Ball","text":"The user draws power from nature and fires it at the target. This may also lower the target’s Sp. Def stat."},{"name":"Brave Bird","text":"The user tucks in its wings and charges from a low altitude. This also damages the user quite a lot."},{"name":"Earth Power","text":"The user makes the ground under the target erupt with power. This may also lower the target’s Sp. Def stat."},{"name":"Switcheroo","text":"The user trades held items with the target faster than the eye can follow."},{"name":"Giga Impact","text":"The user charges at the target using every bit of its power. The user can’t move on the next turn."},{"name":"Nasty Plot","text":"The user stimulates its brain by thinking bad thoughts. This sharply raises the user’s Sp. Atk stat."},{"name":"Bullet Punch","text":"The user strikes the target with tough punches as fast as bullets. This move always goes first."},{"name":"Avalanche","text":"The power of this attack move is doubled if the user has been hurt by the target in the same turn."},{"name":"Ice Shard","text":"The user flash-freezes chunks of ice and hurls them at the target. This move always goes first."},{"name":"Shadow Claw","text":"The user slashes with a sharp claw made from shadows. Critical hits land more easily."},{"name":"Thunder Fang","text":"The user bites with electrified fangs. This may also make the target flinch or leave it with paralysis."},{"name":"Ice Fang","text":"The user bites with cold-infused fangs. This may also make the target flinch or leave it frozen."},{"name":"Fire Fang","text":"The user bites with flame-cloaked fangs. This may also make the target flinch or leave it with a burn."},{"name":"Shadow Sneak","text":"The user extends its shadow and attacks the target from behind. This move always goes first."},{"name":"Mud Bomb","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Psycho Cut","text":"The user tears at the target with blades formed by psychic power. Critical hits land more easily."},{"name":"Zen Headbutt","text":"The user focuses its willpower to its head and attacks the target. This may also make the target flinch."},{"name":"Mirror Shot","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Flash Cannon","text":"The user gathers all its light energy and releases it all at once. This may also lower the target’s Sp. Def stat."},{"name":"Rock Climb","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Defog","text":"A strong wind blows away the target’s barriers such as Reflect or Light Screen. This also lowers the target’s evasiveness."},{"name":"Trick Room","text":"The user creates a bizarre area in which slower Pokémon get to move first for five turns."},{"name":"Draco Meteor","text":"Comets are summoned down from the sky onto the target. The attack’s recoil harshly lowers the user’s Sp. Atk stat."},{"name":"Discharge","text":"The user strikes everything around it by letting loose a flare of electricity. This may also cause paralysis."},{"name":"Lava Plume","text":"The user torches everything around it in an inferno of scarlet flames. This may also leave those it hits with a burn."},{"name":"Leaf Storm","text":"The user whips up a storm of leaves around the target. The attack’s recoil harshly lowers the user’s Sp. Atk stat."},{"name":"Power Whip","text":"The user violently whirls its vines, tentacles, or the like to harshly lash the target."},{"name":"Rock Wrecker","text":"The user launches a huge boulder at the target to attack. The user can’t move on the next turn."},{"name":"Cross Poison","text":"A slashing attack with a poisonous blade that may also poison the target. Critical hits land more easily."},{"name":"Gunk Shot","text":"The user shoots filthy garbage at the target to attack. This may also poison the target."},{"name":"Iron Head","text":"The user slams the target with its steel-hard head. This may also make the target flinch."},{"name":"Magnet Bomb","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Stone Edge","text":"The user stabs the target from below with sharpened stones. Critical hits land more easily."},{"name":"Captivate","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Stealth Rock","text":"The user lays a trap of levitating stones around the opposing team. The trap hurts opposing Pokémon that switch into battle."},{"name":"Grass Knot","text":"The user snares the target with grass and trips it. The heavier the target, the greater the move’s power."},{"name":"Chatter","text":"The user attacks the target with sound waves of deafening chatter. This confuses the target."},{"name":"Judgment","text":"The user releases countless shots of light at the target. This move’s type varies depending on the kind of Plate the user is holding."},{"name":"Bug Bite","text":"The user bites the target. If the target is holding a Berry, the user eats it and gains its effect."},{"name":"Charge Beam","text":"The user attacks the target with an electric charge. The user may use any remaining electricity to raise its Sp. Atk stat."},{"name":"Wood Hammer","text":"The user slams its rugged body into the target to attack. This also damages the user quite a lot."},{"name":"Aqua Jet","text":"The user lunges at the target at a speed that makes it almost invisible. This move always goes first."},{"name":"Attack Order","text":"The user calls out its underlings to pummel the target. Critical hits land more easily."},{"name":"Defend Order","text":"The user calls out its underlings to shield its body, raising its Defense and Sp. Def stats."},{"name":"Heal Order","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Head Smash","text":"The user attacks the target with a hazardous, full-power headbutt. This also damages the user terribly."},{"name":"Double Hit","text":"The user slams the target with a long tail, vines, or a tentacle. The target is hit twice in a row."},{"name":"Roar of Time","text":"The user blasts the target with power that distorts even time. The user can’t move on the next turn."},{"name":"Spacial Rend","text":"The user tears the target along with the space around it. Critical hits land more easily."},{"name":"Lunar Dance","text":"The user faints. In return, the Pokémon taking its place will have its status and HP fully restored."},{"name":"Crush Grip","text":"The target is crushed with great force. The more HP the target has left, the greater this move’s power."},{"name":"Magma Storm","text":"The target becomes trapped within a maelstrom of fire that rages for four to five turns."},{"name":"Dark Void","text":"Opposing Pokémon are dragged into a world of total darkness that makes them sleep."},{"name":"Seed Flare","text":"The user emits a shock wave from its body to attack its target. This may also harshly lower the target’s Sp. Def stat."},{"name":"Ominous Wind","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Shadow Force","text":"The user disappears, then strikes the target on the next turn. This move hits even if the target protects itself."},{"name":"Hone Claws","text":"The user sharpens its claws to boost its Attack stat and accuracy."},{"name":"Wide Guard","text":"The user and its allies are protected from wide-ranging attacks for one turn."},{"name":"Guard Split","text":"The user employs its psychic power to average its Defense and Sp. Def stats with those of the target."},{"name":"Power Split","text":"The user employs its psychic power to average its Attack and Sp. Atk stats with those of the target."},{"name":"Wonder Room","text":"The user creates a bizarre area in which Pokémon’s Defense and Sp. Def stats are swapped for five turns."},{"name":"Psyshock","text":"The user materializes an odd psychic wave to attack the target. This attack does physical damage."},{"name":"Venoshock","text":"The user drenches the target in a special poisonous liquid. This move’s power is doubled if the target is poisoned."},{"name":"Autotomize","text":"The user sheds part of its body to make itself lighter and sharply raise its Speed stat."},{"name":"Rage Powder","text":"The user scatters a cloud of irritating powder to draw attention to itself. Opposing Pokémon aim only at the user."},{"name":"Telekinesis","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Magic Room","text":"The user creates a bizarre area in which Pokémon’s held items lose their effects for five turns."},{"name":"Smack Down","text":"The user throws a stone or similar projectile to attack the target. A flying Pokémon will fall to the ground when it’s hit."},{"name":"Storm Throw","text":"The user strikes the target with a fierce blow. This attack always results in a critical hit."},{"name":"Flame Burst","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sludge Wave","text":"The user strikes everything around it by swamping the area with a giant sludge wave. This may also poison those hit."},{"name":"Quiver Dance","text":"The user lightly performs a beautiful, mystic dance. This boosts the user’s Sp. Atk, Sp. Def, and Speed stats."},{"name":"Heavy Slam","text":"The user slams into the target with its heavy body. The more the user outweighs the target, the greater the move’s power."},{"name":"Synchronoise","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Electro Ball","text":"The user hurls an electric orb at the target. The faster the user is than the target, the greater the move’s power."},{"name":"Soak","text":"The user shoots a torrent of water at the target and changes the target’s type to Water."},{"name":"Flame Charge","text":"Cloaking itself in flame, the user attacks the target. Then, building up more power, the user raises its Speed stat."},{"name":"Coil","text":"The user coils up and concentrates. This raises its Attack and Defense stats as well as its accuracy."},{"name":"Low Sweep","text":"The user makes a swift attack on the target’s legs, which lowers the target’s Speed stat."},{"name":"Acid Spray","text":"The user spits fluid that works to melt the target. This harshly lowers the target’s Sp. Def stat."},{"name":"Foul Play","text":"The user turns the target’s power against it. The higher the target’s Attack stat, the greater the damage it deals."},{"name":"Simple Beam","text":"The user’s mysterious psychic wave changes the target’s Ability to Simple."},{"name":"Entrainment","text":"The user dances with an odd rhythm that compels the target to mimic it, making the target’s Ability the same as the user’s."},{"name":"After You","text":"The user helps the target and makes it use its move right after the user."},{"name":"Round","text":"The user attacks the target with a song. Others can join in the Round to increase the power of the attack."},{"name":"Echoed Voice","text":"The user attacks the target with an echoing voice. If this move is used every turn, its power is increased."},{"name":"Chip Away","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Clear Smog","text":"The user attacks the target by throwing a clump of special mud. All stat changes are returned to normal."},{"name":"Stored Power","text":"The user attacks the target with stored power. The more the user’s stats are raised, the greater the move’s power."},{"name":"Quick Guard","text":"The user protects itself and its allies from priority moves."},{"name":"Ally Switch","text":"The user teleports using a strange power and switches places with one of its allies."},{"name":"Scald","text":"The user shoots boiling hot water at its target. This may also leave the target with a burn."},{"name":"Shell Smash","text":"The user breaks its shell, which lowers Defense and Sp. Def stats but sharply raises its Attack, Sp. Atk, and Speed stats."},{"name":"Heal Pulse","text":"The user emits a healing pulse that restores the target’s HP by up to half of its max HP."},{"name":"Hex","text":"This relentless attack does massive damage to a target affected by status conditions."},{"name":"Sky Drop","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Shift Gear","text":"The user rotates its gears, raising its Attack stat and sharply raising its Speed stat."},{"name":"Circle Throw","text":"The target is thrown, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon."},{"name":"Incinerate","text":"The user attacks opposing Pokémon with fire. If a Pokémon is holding a certain item, such as a Berry, the item becomes burned up and unusable."},{"name":"Quash","text":"The user suppresses the target and makes its move go last."},{"name":"Acrobatics","text":"The user nimbly strikes the target. If the user is not holding an item, this attack inflicts massive damage."},{"name":"Reflect Type","text":"The user reflects the target’s type, making the user the same type as the target."},{"name":"Retaliate","text":"The user gets revenge for a fainted ally. If an ally fainted in the previous turn, this move’s power is increased."},{"name":"Final Gambit","text":"The user risks everything to attack its target. The user faints but does damage equal to its HP."},{"name":"Bestow","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Inferno","text":"The user attacks by engulfing the target in an intense fire. This leaves the target with a burn."},{"name":"Water Pledge","text":"A column of water hits the target. When used with its fire equivalent, its power increases and a rainbow appears."},{"name":"Fire Pledge","text":"A column of fire hits the target. When used with its grass equivalent, its power increases and a vast sea of fire appears."},{"name":"Grass Pledge","text":"A column of grass hits the target. When used with its water equivalent, its power increases and a vast swamp appears."},{"name":"Volt Switch","text":"After making its attack, the user rushes back to switch places with a party Pokémon in waiting."},{"name":"Struggle Bug","text":"While resisting, the user attacks opposing Pokémon. This lowers the Sp. Atk stats of those hit."},{"name":"Bulldoze","text":"The user strikes everything around it by stomping down on the ground. This lowers the Speed stats of those hit."},{"name":"Frost Breath","text":"The user blows its cold breath on the target. This attack always results in a critical hit."},{"name":"Dragon Tail","text":"The target is knocked away, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon."},{"name":"Work Up","text":"The user is roused, and its Attack and Sp. Atk stats increase."},{"name":"Electroweb","text":"The user attacks and captures opposing Pokémon using an electric net. This lowers their Speed stats."},{"name":"Wild Charge","text":"The user shrouds itself in electricity and smashes into its target. This also damages the user a little."},{"name":"Drill Run","text":"The user crashes into its target while rotating its body like a drill. Critical hits land more easily."},{"name":"Dual Chop","text":"The user attacks its target by hitting it with brutal strikes. The target is hit twice in a row."},{"name":"Heart Stamp","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Horn Leech","text":"The user drains the target’s energy with its horns. The user’s HP is restored by half the damage taken by the target."},{"name":"Sacred Sword","text":"The user attacks by slicing with a long horn. The target’s stat changes don’t affect this attack’s damage."},{"name":"Razor Shell","text":"The user cuts its target with sharp shells. This may also lower the target’s Defense stat."},{"name":"Heat Crash","text":"The user slams its target with its flame-covered body. The more the user outweighs the target, the greater the move’s power."},{"name":"Leaf Tornado","text":"The user attacks its target by encircling it in sharp leaves. This attack may also lower the target’s accuracy."},{"name":"Steamroller","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Cotton Guard","text":"The user protects itself by wrapping its body in soft cotton, which drastically raises the user’s Defense stat."},{"name":"Night Daze","text":"The user lets loose a pitch-black shock wave at its target. This may also lower the target’s accuracy."},{"name":"Psystrike","text":"The user materializes an odd psychic wave to attack the target. This attack does physical damage."},{"name":"Tail Slap","text":"The user attacks by striking the target with its hard tail. It hits the target two to five times in a row."},{"name":"Hurricane","text":"The user attacks by wrapping its opponent in a fierce wind that flies up into the sky. This may also confuse the target."},{"name":"Head Charge","text":"The user charges its head into its target, using its powerful guard hair. This also damages the user a little."},{"name":"Gear Grind","text":"The user attacks by throwing steel gears at its target twice."},{"name":"Searing Shot","text":"The user torches everything around it in an inferno of scarlet flames. This may also leave those it hits with a burn."},{"name":"Techno Blast","text":"The user fires a beam of light at its target. The move’s type changes depending on the Drive the user holds."},{"name":"Relic Song","text":"The user sings an ancient song and attacks by appealing to the hearts of the listening opposing Pokémon. This may also induce sleep."},{"name":"Secret Sword","text":"The user cuts with its long horn. The odd power contained in the horn does physical damage to the target."},{"name":"Glaciate","text":"The user attacks by blowing freezing cold air at opposing Pokémon. This lowers their Speed stats."},{"name":"Bolt Strike","text":"The user surrounds itself with a great amount of electricity and charges its target. This may also leave the target with paralysis."},{"name":"Blue Flare","text":"The user attacks by engulfing the target in an intense, yet beautiful, blue flame. This may also leave the target with a burn."},{"name":"Fiery Dance","text":"Cloaked in flames, the user attacks the target by dancing and flapping its wings. This may also raise the user’s Sp. Atk stat."},{"name":"Freeze Shock","text":"On the second turn, the user hits the target with electrically charged ice. This may also leave the target with paralysis."},{"name":"Ice Burn","text":"On the second turn, an ultracold, freezing wind surrounds the target. This may leave the target with a burn."},{"name":"Snarl","text":"The user yells as if it’s ranting about something, which lowers the Sp. Atk stats of opposing Pokémon."},{"name":"Icicle Crash","text":"The user attacks by harshly dropping large icicles onto the target. This may also make the target flinch."},{"name":"V-create","text":"With a hot flame on its forehead, the user hurls itself at its target. This lowers the user’s Defense, Sp. Def, and Speed stats."},{"name":"Fusion Flare","text":"The user brings down a giant flame. This move’s power is increased when influenced by an enormous lightning bolt."},{"name":"Fusion Bolt","text":"The user throws down a giant lightning bolt. This move’s power is increased when influenced by an enormous flame."},{"name":"Flying Press","text":"The user dives down onto the target from the sky. This move is Fighting and Flying type simultaneously."},{"name":"Mat Block","text":"Using a pulled-up mat as a shield, the user protects itself and its allies from damaging moves. This does not stop status moves."},{"name":"Belch","text":"The user lets out a damaging belch at the target. The user must eat a held Berry to use this move."},{"name":"Rototiller","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sticky Web","text":"The user weaves a sticky net around the opposing team, which lowers their Speed stats upon switching into battle."},{"name":"Fell Stinger","text":"When the user knocks out a target with this move, the user’s Attack stat rises drastically."},{"name":"Phantom Force","text":"The user vanishes somewhere, then strikes the target on the next turn. This move hits even if the target protects itself."},{"name":"Trick-or-Treat","text":"The user takes the target trick-or-treating. This adds Ghost type to the target’s type."},{"name":"Noble Roar","text":"Letting out a noble roar, the user intimidates the target and lowers its Attack and Sp. Atk stats."},{"name":"Ion Deluge","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Parabolic Charge","text":"The user attacks everything around it. The user’s HP is restored by half the damage taken by those hit."},{"name":"Forest’s Curse","text":"The user puts a forest curse on the target. The target is now Grass type as well."},{"name":"Petal Blizzard","text":"The user stirs up a violent petal blizzard and attacks everything around it."},{"name":"Freeze-Dry","text":"The user rapidly cools the target. This may also leave the target frozen. This move is super effective on Water types."},{"name":"Disarming Voice","text":"Letting out a charming cry, the user does emotional damage to opposing Pokémon. This attack never misses."},{"name":"Parting Shot","text":"With a parting threat, the user lowers the target’s Attack and Sp. Atk stats. Then it switches with a party Pokémon."},{"name":"Topsy-Turvy","text":"All stat changes affecting the target turn topsy-turvy and become the opposite of what they were."},{"name":"Draining Kiss","text":"The user steals the target’s HP with a kiss. The user’s HP is restored by over half of the damage taken by the target."},{"name":"Crafty Shield","text":"The user protects itself and its allies from status moves with a mysterious power. This does not stop moves that do damage."},{"name":"Flower Shield","text":"The user raises the Defense stats of all Grass-type Pokémon in battle with a mysterious power."},{"name":"Grassy Terrain","text":"The user turns the ground to grass for five turns. This restores the HP of Pokémon on the ground a little every turn and powers up Grass-type moves."},{"name":"Misty Terrain","text":"This protects Pokémon on the ground from status conditions and halves damage from Dragon-type moves for five turns."},{"name":"Electrify","text":"If the target is electrified before it uses a move during that turn, the target’s move becomes Electric type."},{"name":"Play Rough","text":"The user plays rough with the target and attacks it. This may also lower the target’s Attack stat."},{"name":"Fairy Wind","text":"The user stirs up a fairy wind and strikes the target with it."},{"name":"Moonblast","text":"Borrowing the power of the moon, the user attacks the target. This may also lower the target’s Sp. Atk stat."},{"name":"Boomburst","text":"The user attacks everything around it with the destructive power of a terrible, explosive sound."},{"name":"Fairy Lock","text":"By locking down the battlefield, the user keeps all Pokémon from fleeing during the next turn."},{"name":"King’s Shield","text":"The user takes a defensive stance while it protects itself from damage. It also lowers the Attack stat of any attacker that makes direct contact."},{"name":"Play Nice","text":"The user and the target become friends, and the target loses its will to fight. This lowers the target’s Attack stat."},{"name":"Confide","text":"The user tells the target a secret, and the target loses its ability to concentrate. This lowers the target’s Sp. Atk stat."},{"name":"Diamond Storm","text":"The user whips up a storm of diamonds to damage opposing Pokémon. This may also sharply raise the user’s Defense stat."},{"name":"Steam Eruption","text":"The user immerses the target in superheated steam. This may also leave the target with a burn."},{"name":"Hyperspace Hole","text":"Using a hyperspace hole, the user appears right next to the target and strikes. This also hits a target using a move such as Protect or Detect."},{"name":"Water Shuriken","text":"The user hits the target with throwing stars two to five times in a row. This move always goes first."},{"name":"Mystical Fire","text":"The user attacks by breathing a special, hot fire. This also lowers the target’s Sp. Atk stat."},{"name":"Spiky Shield","text":"In addition to protecting the user from attacks, this move also damages any attacker that makes direct contact."},{"name":"Aromatic Mist","text":"The user raises the Sp. Def stat of an ally Pokémon by using a mysterious aroma."},{"name":"Eerie Impulse","text":"The user’s body generates an eerie impulse. Exposing the target to it harshly lowers the target’s Sp. Atk stat."},{"name":"Venom Drench","text":"Opposing Pokémon are drenched in an odd poisonous liquid. This lowers the Attack, Sp. Atk, and Speed stats of a poisoned target."},{"name":"Powder","text":"The user covers the target in a combustible powder. If the target uses a Fire-type move, the powder explodes and damages the target."},{"name":"Geomancy","text":"The user absorbs energy and sharply raises its Sp. Atk, Sp. Def, and Speed stats on the next turn."},{"name":"Magnetic Flux","text":"The user manipulates magnetic fields, which raises the Defense and Sp. Def stats of ally Pokémon with the Plus or Minus Ability."},{"name":"Happy Hour","text":"Using Happy Hour doubles the amount of prize money received after battle."},{"name":"Electric Terrain","text":"The user electrifies the ground for five turns, powering up Electric-type moves. Pokémon on the ground no longer fall asleep."},{"name":"Dazzling Gleam","text":"The user damages opposing Pokémon by emitting a powerful flash."},{"name":"Celebrate","text":"The Pokémon congratulates you on your special day!"},{"name":"Hold Hands","text":"The user and an ally hold hands. This makes them very happy."},{"name":"Baby-Doll Eyes","text":"The user stares at the target with its baby-doll eyes, which lowers the target’s Attack stat. This move always goes first."},{"name":"Nuzzle","text":"The user attacks by nuzzling its electrified cheeks against the target. This also leaves the target with paralysis."},{"name":"Hold Back","text":"The user holds back when it attacks, and the target is left with at least 1 HP."},{"name":"Infestation","text":"The target is infested and attacked for four to five turns. The target can’t flee during this time."},{"name":"Power-Up Punch","text":"Striking opponents over and over makes the user’s fists harder. Hitting a target raises the Attack stat."},{"name":"Oblivion Wing","text":"The user absorbs its target’s HP. The user’s HP is restored by over half of the damage taken by the target."},{"name":"Thousand Arrows","text":"This move also hits opposing Pokémon that are in the air. Those Pokémon are knocked down to the ground."},{"name":"Thousand Waves","text":"The user attacks with a wave that crawls along the ground. Those it hits can’t flee from battle."},{"name":"Land’s Wrath","text":"The user gathers the energy of the land and focuses that power on opposing Pokémon to damage them."},{"name":"Light of Ruin","text":"Drawing power from the Eternal Flower, the user fires a powerful beam of light. This also damages the user quite a lot."},{"name":"Origin Pulse","text":"The user attacks opposing Pokémon with countless beams of light that glow a deep and brilliant blue."},{"name":"Precipice Blades","text":"The user attacks opposing Pokémon by manifesting the power of the land in fearsome blades of stone."},{"name":"Dragon Ascent","text":"After soaring upward, the user attacks its target by dropping out of the sky at high speeds. But it lowers its own Defense and Sp. Def stats in the process."},{"name":"Hyperspace Fury","text":"Using its many arms, the user unleashes a barrage of attacks that ignore the effects of moves like Protect and Detect. But the user’s Defense stat falls."},{"name":"Breakneck Blitz","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Breakneck Blitz","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"All-Out Pummeling","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"All-Out Pummeling","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Supersonic Skystrike","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Supersonic Skystrike","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Acid Downpour","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Acid Downpour","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Tectonic Rage","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Tectonic Rage","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Continental Crush","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Continental Crush","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Savage Spin-Out","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Savage Spin-Out","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Never-Ending Nightmare","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Never-Ending Nightmare","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Corkscrew Crash","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Corkscrew Crash","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Inferno Overdrive","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Inferno Overdrive","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Hydro Vortex","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Hydro Vortex","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Bloom Doom","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Bloom Doom","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Gigavolt Havoc","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Gigavolt Havoc","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Shattered Psyche","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Shattered Psyche","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Subzero Slammer","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Subzero Slammer","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Devastating Drake","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Devastating Drake","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Black Hole Eclipse","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Black Hole Eclipse","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Twinkle Tackle","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Twinkle Tackle","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Catastropika","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Shore Up","text":"The user regains up to half of its max HP. It restores more HP in a sandstorm."},{"name":"First Impression","text":"Although this move has great power, it only works the first turn each time the user enters battle."},{"name":"Baneful Bunker","text":"In addition to protecting the user from attacks, this move also poisons any attacker that makes direct contact."},{"name":"Spirit Shackle","text":"The user attacks while simultaneously stitching the target’s shadow to the ground to prevent the target from escaping."},{"name":"Darkest Lariat","text":"The user swings both arms and hits the target. The target’s stat changes don’t affect this attack’s damage."},{"name":"Sparkling Aria","text":"The user bursts into song, emitting many bubbles. Any Pokémon suffering from a burn will be healed by the touch of these bubbles."},{"name":"Ice Hammer","text":"The user swings and hits with its strong, heavy fist. It lowers the user’s Speed, however."},{"name":"Floral Healing","text":"The user restores the target’s HP by up to half of its max HP. It restores more HP when the terrain is grass."},{"name":"High Horsepower","text":"The user fiercely attacks the target using its entire body."},{"name":"Strength Sap","text":"The user restores its HP by the same amount as the target’s Attack stat. It also lowers the target’s Attack stat."},{"name":"Solar Blade","text":"In this two-turn attack, the user gathers light and fills a blade with the light’s energy, attacking the target on the next turn."},{"name":"Leafage","text":"The user attacks by pelting the target with leaves."},{"name":"Spotlight","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Toxic Thread","text":"The user shoots poisonous threads to poison the target and lower the target’s Speed stat."},{"name":"Laser Focus","text":"The user concentrates intensely. The attack on the next turn always results in a critical hit."},{"name":"Gear Up","text":"The user engages its gears to raise the Attack and Sp. Atk stats of ally Pokémon with the Plus or Minus Ability."},{"name":"Throat Chop","text":"The user attacks the target’s throat, and the resultant suffering prevents the target from using moves that emit sound for two turns."},{"name":"Pollen Puff","text":"The user attacks the enemy with a pollen puff that explodes. If the target is an ally, it gives the ally a pollen puff that restores its HP instead."},{"name":"Anchor Shot","text":"The user entangles the target with its anchor chain while attacking. The target becomes unable to flee."},{"name":"Psychic Terrain","text":"This protects Pokémon on the ground from priority moves and powers up Psychic-type moves for five turns."},{"name":"Lunge","text":"The user makes a lunge at the target, attacking with full force. This also lowers the target’s Attack stat."},{"name":"Fire Lash","text":"The user strikes the target with a burning lash. This also lowers the target’s Defense stat."},{"name":"Power Trip","text":"The user boasts its strength and attacks the target. The more the user’s stats are raised, the greater the move’s power."},{"name":"Burn Up","text":"To inflict massive damage, the user burns itself out. After using this move, the user will no longer be Fire type."},{"name":"Speed Swap","text":"The user exchanges Speed stats with the target."},{"name":"Smart Strike","text":"The user stabs the target with a sharp horn. This attack never misses."},{"name":"Purify","text":"The user heals the target’s status condition. If the move succeeds, it also restores the user’s own HP."},{"name":"Revelation Dance","text":"The user attacks the target by dancing very hard. The user’s type determines the type of this move."},{"name":"Core Enforcer","text":"If the Pokémon the user has inflicted damage on have already used their moves, this move eliminates the effect of the target’s Ability."},{"name":"Trop Kick","text":"The user lands an intense kick of tropical origins on the target. This also lowers the target’s Attack stat."},{"name":"Instruct","text":"The user instructs the target to use the target’s last move again."},{"name":"Beak Blast","text":"The user first heats up its beak, and then it attacks the target. Making direct contact with the Pokémon while it’s heating up its beak results in a burn."},{"name":"Clanging Scales","text":"The user rubs the scales on its entire body and makes a huge noise to attack opposing Pokémon. The user’s Defense stat goes down after the attack."},{"name":"Dragon Hammer","text":"The user uses its body like a hammer to attack the target and inflict damage."},{"name":"Brutal Swing","text":"The user swings its body around violently to inflict damage on everything in its vicinity."},{"name":"Aurora Veil","text":"This move reduces damage from physical and special moves for five turns. This can be used only in a hailstorm."},{"name":"Sinister Arrow Raid","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Malicious Moonsault","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Oceanic Operetta","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Guardian of Alola","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Soul-Stealing 7-Star Strike","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Stoked Sparksurfer","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Pulverizing Pancake","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Extreme Evoboost","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Genesis Supernova","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Shell Trap","text":"The user sets a shell trap. If the user is hit by a physical move, the trap will explode and inflict damage on opposing Pokémon."},{"name":"Fleur Cannon","text":"The user unleashes a strong beam. The attack’s recoil harshly lowers the user’s Sp. Atk stat."},{"name":"Psychic Fangs","text":"The user bites the target with its psychic capabilities. This can also destroy Light Screen and Reflect."},{"name":"Stomping Tantrum","text":"Driven by frustration, the user attacks the target. If the user’s previous move has failed, the power of this move doubles."},{"name":"Shadow Bone","text":"The user attacks by beating the target with a bone that contains a spirit. This may also lower the target’s Defense stat."},{"name":"Accelerock","text":"The user smashes into the target at high speed. This move always goes first."},{"name":"Liquidation","text":"The user slams into the target using a full-force blast of water. This may also lower the target’s Defense stat."},{"name":"Prismatic Laser","text":"The user shoots powerful lasers using the power of a prism. The user can’t move on the next turn."},{"name":"Spectral Thief","text":"The user hides in the target’s shadow, steals the target’s stat boosts, and then attacks."},{"name":"Sunsteel Strike","text":"The user slams into the target with the force of a meteor. This move can be used on the target regardless of its Abilities."},{"name":"Moongeist Beam","text":"The user emits a sinister ray to attack the target. This move can be used on the target regardless of its Abilities."},{"name":"Tearful Look","text":"The user gets teary eyed to make the target lose its combative spirit. This lowers the target’s Attack and Sp. Atk stats."},{"name":"Zing Zap","text":"A strong electric blast crashes down on the target, giving it an electric shock. This may also make the target flinch."},{"name":"Nature’s Madness","text":"The user hits the target with the force of nature. It halves the target’s HP."},{"name":"Multi-Attack","text":"Cloaking itself in high energy, the user slams into the target. The memory held determines the move’s type."},{"name":"10,000,000 Volt Thunderbolt","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Mind Blown","text":"The user attacks everything around it by causing its own head to explode. This also damages the user."},{"name":"Plasma Fists","text":"The user attacks with electrically charged fists. This move changes Normal-type moves to Electric-type moves."},{"name":"Photon Geyser","text":"The user attacks a target with a pillar of light. This move inflicts Attack or Sp. Atk damage—whichever stat is higher for the user."},{"name":"Light That Burns the Sky","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Searing Sunraze Smash","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Menacing Moonraze Maelstrom","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Let’s Snuggle Forever","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Splintered Stormshards","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Clangorous Soulblaze","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Zippy Zap","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Splishy Splash","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Floaty Fall","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Pika Papow","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Bouncy Bubble","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Buzzy Buzz","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sizzly Slide","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Glitzy Glow","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Baddy Bad","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sappy Seed","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Freezy Frost","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Sparkly Swirl","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Veevee Volley","text":"This move can’t be used. It’s recommended that this move is forgotten. Once forgotten, this move can’t be remembered."},{"name":"Double Iron Bash","text":"The user rotates, centering the hex nut in its chest, and then strikes with its arms twice in a row. This may also make the target flinch."},{"name":"Max Guard","text":"This move enables the user to protect itself from all attacks. Its chance of failing rises if it is used in succession."},{"name":"Dynamax Cannon","text":"The user unleashes a strong beam from its core. This move deals twice the damage if the target is Dynamaxed."},{"name":"Snipe Shot","text":"The user ignores the effects of opposing Pokémon’s moves and Abilities that draw in moves, allowing this move to hit the chosen target."},{"name":"Jaw Lock","text":"This move prevents the user and the target from switching out until either of them faints. The effect goes away if either of the Pokémon leaves the field."},{"name":"Stuff Cheeks","text":"The user eats its held Berry, then sharply raises its Defense stat."},{"name":"No Retreat","text":"This move raises all the user’s stats but prevents the user from switching out or fleeing."},{"name":"Tar Shot","text":"The user pours sticky tar over the target, lowering the target’s Speed stat. The target becomes weaker to Fire-type moves."},{"name":"Magic Powder","text":"The user scatters a cloud of magic powder that changes the target to Psychic type."},{"name":"Dragon Darts","text":"The user attacks twice using Dreepy. If there are two targets, this move hits each target once."},{"name":"Teatime","text":"The user has teatime with all the Pokémon in the battle. Each Pokémon eats its held Berry."},{"name":"Octolock","text":"The user locks the target in and prevents it from fleeing. This move also lowers the target’s Defense and Sp. Def every turn."},{"name":"Bolt Beak","text":"The user stabs the target with its electrified beak. If the user attacks before the target, the power of this move is doubled."},{"name":"Fishious Rend","text":"The user rends the target with its hard gills. If the user attacks before the target, the power of this move is doubled."},{"name":"Court Change","text":"With its mysterious power, the user swaps the effects on either side of the field."},{"name":"Max Flare","text":"This is a Fire-type attack Dynamax Pokémon use. The user intensifies the sun for five turns."},{"name":"Max Flutterby","text":"This is a Bug-type attack Dynamax Pokémon use. This lowers the target’s Sp. Atk stat."},{"name":"Max Lightning","text":"This is an Electric-type attack Dynamax Pokémon use. The user turns the ground into Electric Terrain for five turns."},{"name":"Max Strike","text":"This is a Normal-type attack Dynamax Pokémon use. This lowers the target’s Speed stat."},{"name":"Max Knuckle","text":"This is a Fighting-type attack Dynamax Pokémon use. This raises ally Pokémon’s Attack stats."},{"name":"Max Phantasm","text":"This is a Ghost-type attack Dynamax Pokémon use. This lowers the target’s Defense stat."},{"name":"Max Hailstorm","text":"This is an Ice-type attack Dynamax Pokémon use. The user summons a hailstorm lasting five turns."},{"name":"Max Ooze","text":"This is a Poison-type attack Dynamax Pokémon use. This raises ally Pokémon’s Sp. Atk stats."},{"name":"Max Geyser","text":"This is a Water-type attack Dynamax Pokémon use. The user summons a heavy rain that falls for five turns."},{"name":"Max Airstream","text":"This is a Flying-type attack Dynamax Pokémon use. This raises ally Pokémon’s Speed stats."},{"name":"Max Starfall","text":"This is a Fairy-type attack Dynamax Pokémon use. The user turns the ground into Misty Terrain for five turns."},{"name":"Max Wyrmwind","text":"This is a Dragon-type attack Dynamax Pokémon use. This lowers the target’s Attack stat."},{"name":"Max Mindstorm","text":"This is a Psychic-type attack Dynamax Pokémon use. The user turns the ground into Psychic Terrain for five turns."},{"name":"Max Rockfall","text":"This is a Rock-type attack Dynamax Pokémon use. The user summons a sandstorm lasting five turns."},{"name":"Max Quake","text":"This is a Ground-type attack Dynamax Pokémon use. This raises ally Pokémon’s Sp. Def stats."},{"name":"Max Darkness","text":"This is a Dark-type attack Dynamax Pokémon use. This lowers the target’s Sp. Def stat."},{"name":"Max Overgrowth","text":"This is a Grass-type attack Dynamax Pokémon use. The user turns the ground into Grassy Terrain for five turns."},{"name":"Max Steelspike","text":"This is a Steel-type attack Dynamax Pokémon use. This raises ally Pokémon’s Defense stats."},{"name":"Clangorous Soul","text":"The user raises all its stats by using some of its HP."},{"name":"Body Press","text":"The user attacks by slamming its body into the target. The higher the user’s Defense, the more damage it can inflict on the target."},{"name":"Decorate","text":"The user sharply raises the target’s Attack and Sp. Atk stats by decorating the target."},{"name":"Drum Beating","text":"The user plays its drum, controlling the drum’s roots to attack the target. This also lowers the target’s Speed stat."},{"name":"Snap Trap","text":"The user snares the target in a snap trap for four to five turns."},{"name":"Pyro Ball","text":"The user attacks by igniting a small stone and launching it as a fiery ball at the target. This may also leave the target with a burn."},{"name":"Behemoth Blade","text":"The user becomes a gigantic sword and cuts the target. This move deals twice the damage if the target is Dynamaxed."},{"name":"Behemoth Bash","text":"The user becomes a gigantic shield and slams into the target. This move deals twice the damage if the target is Dynamaxed."},{"name":"Aura Wheel","text":"Morpeko attacks and raises its Speed with the energy stored in its cheeks. This move’s type changes depending on the user’s form."},{"name":"Breaking Swipe","text":"The user swings its tough tail wildly and attacks opposing Pokémon. This also lowers their Attack stats."},{"name":"Branch Poke","text":"The user attacks the target by poking it with a sharply pointed branch."},{"name":"Overdrive","text":"The user attacks opposing Pokémon by twanging a guitar or bass guitar, causing a huge echo and strong vibration."},{"name":"Apple Acid","text":"The user attacks the target with an acidic liquid created from tart apples. This also lowers the target’s Sp. Def stat."},{"name":"Grav Apple","text":"The user inflicts damage by dropping an apple from high above. This also lowers the target’s Defense stat."},{"name":"Spirit Break","text":"The user attacks the target with so much force that it could break the target’s spirit. This also lowers the target’s Sp. Atk stat."},{"name":"Strange Steam","text":"The user attacks the target by emitting steam. This may also confuse the target."},{"name":"Life Dew","text":"The user scatters mysterious water around and restores the HP of itself and its ally Pokémon in the battle."},{"name":"Obstruct","text":"This move enables the user to protect itself from all attacks. Its chance of failing rises if it is used in succession. Direct contact harshly lowers the attacker’s Defense stat."},{"name":"False Surrender","text":"The user pretends to bow its head, but then it stabs the target with its disheveled hair. This attack never misses."},{"name":"Meteor Assault","text":"The user attacks wildly with its thick leek. The user can’t move on the next turn, because the force of this move makes it stagger."},{"name":"Eternabeam","text":"This is Eternatus’s most powerful attack in its original form. The user can’t move on the next turn."},{"name":"Steel Beam","text":"The user fires a beam of steel that it collected from its entire body. This also damages the user."}]